[
    {
        "type": "INTJ",
        "description": "These thoughtful tacticians love perfecting the details of life, applying creativity and rationality to everything they do. Their inner world is often a private, complex one. It can be lonely at the top. As one of the rarest personality types - and one of the most capable - they know this all too well. Rational and quick-witted, they pride themselves on their ability to think for themselves, not to mention their uncanny knack for seeing right through phoniness and hypocrisy. But because their minds are never at rest, they may struggle to find people who can keep up with their nonstop analysis of everything around them."
    },
    {
        "type": "INTP",
        "description": "These flexible thinkers enjoy taking an unconventional approach to many aspects of life. They often seek out unlikely paths, mixing willingness to experiment with personal creativity. they pride themselves on their unique perspectives and vigorous intellect. They can't help but puzzle over the mysteries of the universe - which may explain why some of the most influential philosophers and scientists of all time have been they. This personality type is fairly rare, but with their creativity and inventiveness, they aren't afraid to stand out from the crowd."
    },
    {
        "type": "ENTJ",
        "description": "They are decisive people who love momentum and accomplishment. They gather information to construct their creative visions but rarely hesitate for long before acting on them. they are natural-born leaders. People with this personality type embody the gifts of charisma and confidence, and project authority in a way that draws crowds together behind a common goal. However, they are also characterized by an often ruthless level of rationality, using their drive, determination and sharp minds to achieve whatever end they've set for themselves. Perhaps it is best that they make up only three percent of the population, lest they overwhelm the more timid and sensitive personality types that make up much of the rest of the world - but we have they to thank for many of the businesses and institutions we take for granted every day."
    },
    {
        "type": "ENTP",
        "description": "They tend to be bold and creative, deconstructing and rebuilding ideas with great mental agility. They pursue their goals vigorously despite any resistance they might encounter. Quick-witted and audacious, they aren't afraid to disagree with the status quo. In fact, they're not afraid to disagree with pretty much anything or anyone. Few things light up people with this personality type more than a bit of verbal sparring - and if the conversation veers into controversial terrain, so much the better. It would be a mistake, though, to think of they as disagreeable or mean-spirited. Instead, people with this personality type are knowledgeable and curious, with a playful sense of humor, and they can be incredibly entertaining. They simply have an offbeat, contrarian idea of fun - one that involves a healthy dose of spirited debate."
    },
    {
        "type": "INFJ",
        "description": "They tend to approach life with deep thoughtfulness and imagination. Their inner vision, personal values, and a quiet, principled version of humanism guide them in all things. they may be the rarest personality type of all, but they certainly leave their mark on the world. Idealistic and principled, they aren't content to coast through life - they want to stand up and make a difference. For this personalities, success doesn't come from money or status but from seeking fulfillment, helping others, and being a force for good in the world. While they have lofty goals and ambitions, they shouldn't be mistaken for idle dreamers. People with this personality type care about integrity, and they're rarely satisfied until they've done what they know to be right. Conscientious to the core, they move through life with a clear sense of their values, and they aim never to lose sight of what truly matters - not according to other people or society at large, but according to their own wisdom and intuition."
    },
    {
        "type": "INFP",
        "description": "These rare personality types tend to be quiet, open-minded, and imaginative, and they apply a caring and creative approach to everything they do. Although they may seem quiet or unassuming, they have vibrant, passionate inner lives. Creative and imaginative, they happily lose themselves in daydreams, inventing all sorts of stories and conversations in their minds. These personalities are known for their sensitivity - they can have profound emotional responses to music, art, nature, and the people around them. Idealistic and empathetic, they long for deep, soulful relationships, and they feel called to help others. But because this personality type makes up such a small portion of the population, they may sometimes feel lonely or invisible, adrift in a world that doesn't seem to appreciate the traits that make them unique."
    },
    {
        "type": "ENFJ",
        "description": "These warm, forthright types love helping others, and they tend to have strong ideas and values. They back their perspective with the creative energy to achieve their goals. they feel called to serve a greater purpose in life. Thoughtful and idealistic, these personality types strive to have a positive impact on other people and the world around them. They rarely shy away from an opportunity to do the right thing, even when doing so is far from easy. they are born leaders, which explains why these personalities can be found among many notable politicians, coaches, and teachers. Their passion and charisma allow them to inspire others not just in their careers but in every arena of their lives, including their relationships. Few things bring they a deeper sense of joy and fulfillment than guiding friends and loved ones to grow into their best selves."
    },
    {
        "type": "ENFP",
        "description": "These people tend to embrace big ideas and actions that reflect their sense of hope and goodwill toward others. Their vibrant energy can flow in many directions. they are true free spirits - outgoing, openhearted, and open-minded. With their lively, upbeat approach to life, they stand out in any crowd. But even though they can be the life of the party, they don't just care about having a good time. These personality types run deep - as does their longing for meaningful, emotional connections with other people."
    },
    {
        "type": "ISTJ",
        "description": "These people tend to be reserved yet willful, with a rational outlook on life. They compose their actions carefully and carry them out with methodical purpose. they pride themselves on their integrity. People with this personality type mean what they say, and when they commit to doing something, they make sure to follow through. This personality type makes up a good portion of the overall population, and while they may not be particularly flashy or attention-seeking, they do more than their share to keep society on a sturdy, stable foundation. In their families and their communities, they often earn respect for their reliability, their practicality, and their ability to stay grounded and logical, even in the most stressful situations."
    },
    {
        "type": "ISFJ",
        "description": "These people tend to be warm and unassuming in their own steady way. They're efficient and responsible, giving careful attention to practical details in their daily lives. In their unassuming, understated way, they help make the world go round. Hardworking and devoted, people with this personality type feel a deep sense of responsibility to those around them. they can be counted on to meet deadlines, remember birthdays and special occasions, uphold traditions, and shower their loved ones with gestures of care and support. But they rarely demand recognition for all that they do, preferring instead to operate behind the scenes. This is a capable, can-do personality type, with a wealth of versatile gifts. Though sensitive and caring, they also have excellent analytical abilities and an eye for detail. And despite their reserve, they tend to have well-developed people skills and robust social relationships. they are truly more than the sum of their parts, and their varied strengths shine in even the most ordinary aspects of their daily lives."
    },
    {
        "type": "ESTJ",
        "description": "They possess great fortitude, emphatically following their own sensible judgment. They often serve as a stabilizing force among others, able to offer solid direction amid adversity. they are representatives of tradition and order, utilizing their understanding of what is right, wrong and socially acceptable to bring families and communities together. Embracing the values of honesty, dedication and dignity, people with the this personality type are valued for their clear advice and guidance, and they happily lead the way on difficult paths. Taking pride in bringing people together, they often take on roles as community organizers, working hard to bring everyone together in celebration of cherished local events, or in defense of the traditional values that hold families and communities together."
    },
    {
        "type": "ESFJ",
        "description": "They are attentive and people-focused, and they enjoy taking part in their social community. Their achievements are guided by decisive values, and they willingly offer guidance to others. For they, life is sweetest when it's shared with others. People with this personality type form the bedrock of many communities, opening their homes - and their hearts - to friends, loved ones, and neighbors. This doesn't mean that they like everyone, or that they're saints. But they do believe in the power of hospitality and good manners, and they tend to feel a sense of duty to those around them. Generous and reliable, people with this personality type often take it upon themselves - in ways both large and small - to hold their families and their communities together."
    },
    {
        "type": "ISTP",
        "description": "They tend to have an individualistic mindset, pursuing goals without needing much external connection. They engage in life with inquisitiveness and personal skill, varying their approach as needed. they love to explore with their hands and their eyes, touching and examining the world around them with cool rationalism and spirited curiosity. People with this personality type are natural Makers, moving from project to project, building the useful and the superfluous for the fun of it, and learning from their environment as they go. Often mechanics and engineers, they find no greater joy than in getting their hands dirty pulling things apart and putting them back together, just a little bit better than they were before. they explore ideas through creating, troubleshooting, trial and error and first-hand experience. They enjoy having other people take an interest in their projects and sometimes don't even mind them getting into their space. Of course, that's on the condition that those people don't interfere with they' principles and freedom, and they'll need to be open to they returning the interest in kind. they enjoy lending a hand and sharing their experience, especially with the people they care about, and it's a shame they're so uncommon, making up only about five percent of the population."
    },
    {
        "type": "ISFP",
        "description": "They tend to have open minds, approaching life, new experiences, and people with grounded warmth. Their ability to stay in the moment helps them uncover exciting potentials. they are true artists - although not necessarily in the conventional sense. For this personality type, life itself is a canvas for self-expression. From what they wear to how they spend their free time, they act in ways that vividly reflect who they are as unique individuals. They are certainly unique. Driven by curiosity and eager to try new things, people with this personality often have a fascinating array of passions and interests. With their exploratory spirits and their ability to find joy in everyday life, they can be among the most interesting people you'll ever meet. The only irony? Unassuming and humble, they tend to see themselves as “just doing their own thing,” so they may not even realize how remarkable they really are."
    },
    {
        "type": "ESTP",
        "description": "They tend to be energetic and action-oriented, deftly navigating whatever is in front of them. They love uncovering life's opportunities, whether socializing with others or in more personal pursuits. ESTPs always have an impact on their immediate surroundings - the best way to spot them at a party is to look for the whirling eddy of people flitting about them as they move from group to group. Laughing and entertaining with a blunt and earthy humor, ESTP personalities love to be the center of attention. If an audience member is asked to come on stage, ESTPs volunteer - or volunteer a shy friend. Theory, abstract concepts and plodding discussions about global issues and their implications don't keep ESTPs interested for long. ESTPs keep their conversation energetic, with a good dose of intelligence, but they like to talk about what is - or better yet, to just go out and do it. ESTPs leap before they look, fixing their mistakes as they go, rather than sitting idle, preparing contingencies and escape clauses."
    },
    {
        "type": "ESFP",
        "description": "These people love vibrant experiences, engaging in life eagerly and taking pleasure in discovering the unknown. They can be very social, often encouraging others into shared activities. If anyone is to be found spontaneously breaking into song and dance, it is the ESFP personality type. ESFPs get caught up in the excitement of the moment, and want everyone else to feel that way, too. No other personality type is as generous with their time and energy as ESFPs when it comes to encouraging others, and no other personality type does it with such irresistible style."
    }
]